MinaRaoufAziz/AVR_ATMEGA32A_SDK/timer.c
/**
 * @file:           timer.c
 * @author:         Mina Raouf
 * @brief:          This file contains the implementation of the timers driver for ATMEGA32A.
 * @version:        1.0
 * @date:           2022-07-09
 * 
 * @copyright Copyright (c) 2022
 * 
 */

#include "timer.h"
#include "errors.h"
#include "gpio.h"
#include "atmega32a_register_file.h"
#include "bit_manipulation.h"
#include "lcd.h"
#include <avr/interrupt.h>

#ifndef F_CPU
#define F_CPU                                   16000000UL
#endif


#define MUL_FACTOR                              1000000         /*Factor to convert the F_CPU from Million to a single digit*/
#define CONVERT_FROM_MILLI_TO_MICRO             1000
#define CONVERT_FROM_NANO_TO_MILLI              1000
#define COUNTS_TILL_OVERFLOW_IN_8_BIT_TIMER     256
#define OVERFLOW_VALUE_IN_8_BIT_TIMER           255
#define COUNTS_TILL_OVERFLOW_IN_16_BIT_TIMER    65536
#define OVERFLOW_VALUE_IN_16_BIT_TIMER          65535
#define NUMBER_OF_SUPPORTED_TIMERS              3
#define FIND_ARR_LENGTH(ARR_NAME)               ((sizeof(ARR_NAME)) / sizeof(ARR_NAME[0]))
#define MIN_DELAY_VALUE                         0
#define MIN_DUTY_CYCLE_VALUE                    0
#define MAX_DUTY_CYCLE_VALUE                    100

#define I_BIT                                   7

#define TOIE0_BIT                               0
#define OCIE0_BIT                               1

#define TOIE1_BIT                               0
#define OCIE1A_BIT                              1
#define OCIE1B_BIT                              1
#define TICIE1_BIT                              0

#define TOIE2_BIT                               6
#define OCIE2_BIT                               7

#define WGM00_BIT                               6
#define WGM01_BIT                               3

#define WGM20_BIT                               6
#define WGM21_BIT                               3

#define TOV0_BIT                                0
#define OCF0_BIT                                1
#define TOV1_BIT                                2
#define OCF1B_BIT                               3
#define OCF1A_BIT                               4
#define ICF1_BIT                                5
#define TOV2_BIT                                6
#define OCF2_BIT                                7

#define DISABLE_TIMER_MASK                      0xF8


/**
 * @brief: Sturcture that contains all the parameters needed to track the Timers configuration database.
 * 
 */
typedef struct
{
    uint8_type                          uint8_is_timer_enabled_in_db;
    enum_timer_mode_type                enum_timer_mode_in_db;
    enum_timer_index_type               enum_timer_index_in_db;
    enum_timer_prescalar_value_type		enum_timer_prescalar_value_in_db;
    pointer_func_timer_callback_type    pointer_func_timer_callback_in_db;
}struct_timer_database_type;

#if (0)
static struct_timer_database_type global_arr_str_timer_database[NUMBER_OF_SUPPORTED_TIMERS] =   {
                                                                                                    {
                                                                                                        .enum_timer_index               = TIMER_INDEX_INVALID,
                                                                                                        .pointer_func_timer_callback    = NULL_PTR
                                                                                                    }

                                                                                                    {
                                                                                                        .enum_timer_index               = TIMER_INDEX_INVALID,
                                                                                                        .pointer_func_timer_callback    = NULL_PTR
                                                                                                    }

                                                                                                    {
                                                                                                        .enum_timer_index               = TIMER_INDEX_INVALID,
                                                                                                        .pointer_func_timer_callback    = NULL_PTR
                                                                                                    }
                                                                                                };
#endif

static struct_timer_database_type   global_arr_str_timer_database[NUMBER_OF_SUPPORTED_TIMERS];
static uint8_type                   global_bool_need_to_init_database   = TRUE;
static volatile uint32_type         global_timer_0_needed_interrupts    = 0;
static volatile uint32_type         global_timer_1_needed_interrupts    = 0;
static volatile uint32_type         global_timer_2_needed_interrupts    = 0;
static enum_timer_index_type        global_timer_index_with_polling     = TIMER_INDEX_INVALID;

static void init_timers_database(void);
static sint32_type delay_timer_0(uint32_type uint32_delay_in_ms);
static sint32_type delay_timer_1(uint32_type uint32_delay_in_ms);
static sint32_type delay_timer_2(uint32_type uint32_delay_in_ms);
static sint32_type generate_pwm_timer_0(uint8_type uint8_duty_cycle);
static sint32_type generate_pwm_timer_1(uint8_type uint8_duty_cycle);
static sint32_type generate_pwm_timer_2(uint8_type uint8_duty_cycle);
static void wait_for_timer_interrupt_flag(enum_timer_index_type enum_timer_index_with_polling);

ISR(TIMER0_OVF_vect)
{
    static volatile uint32_type uint32_local_interrupt_counter = 0;
    uint32_local_interrupt_counter++;

    if(uint32_local_interrupt_counter == global_timer_0_needed_interrupts)
    {
        uint32_local_interrupt_counter     = 0;
        if(global_arr_str_timer_database[TIMER_INDEX_0].pointer_func_timer_callback_in_db != NULL_PTR)
        {
            global_arr_str_timer_database[TIMER_INDEX_0].pointer_func_timer_callback_in_db(TIMER_INDEX_0);
        }
    }
}

ISR(TIMER0_COMP_vect)
{
	static volatile uint32_type uint32_local_interrupt_counter = 0;
	uint32_local_interrupt_counter++;

	if(uint32_local_interrupt_counter == global_timer_0_needed_interrupts)
	{
		uint32_local_interrupt_counter     = 0;
		if(global_arr_str_timer_database[TIMER_INDEX_0].pointer_func_timer_callback_in_db != NULL_PTR)
		{
			global_arr_str_timer_database[TIMER_INDEX_0].pointer_func_timer_callback_in_db(TIMER_INDEX_0);
		}
	}
}

