MinaRaoufAziz/AVR_ATMEGA32A_SDK/timer.c
ISR(TIMER2_OVF_vect)
{
	static volatile uint32_type uint32_local_interrupt_counter = 0;
	uint32_local_interrupt_counter++;

	if(uint32_local_interrupt_counter == global_timer_2_needed_interrupts)
	{
		uint32_local_interrupt_counter     = 0;
		if(global_arr_str_timer_database[TIMER_INDEX_2].pointer_func_timer_callback_in_db != NULL_PTR)
		{
			global_arr_str_timer_database[TIMER_INDEX_2].pointer_func_timer_callback_in_db(TIMER_INDEX_2);
		}
	}
}

ISR(TIMER2_COMP_vect)
{
	static volatile uint32_type uint32_local_interrupt_counter = 0;
	uint32_local_interrupt_counter++;

	if(uint32_local_interrupt_counter == global_timer_2_needed_interrupts)
	{
		uint32_local_interrupt_counter     = 0;
		if(global_arr_str_timer_database[TIMER_INDEX_2].pointer_func_timer_callback_in_db != NULL_PTR)
		{
			global_arr_str_timer_database[TIMER_INDEX_2].pointer_func_timer_callback_in_db(TIMER_INDEX_2);
		}
	}
}

static void init_timers_database(void)
{
    uint8_type uint8_iterator;
    for(uint8_iterator = 0; uint8_iterator < FIND_ARR_LENGTH(global_arr_str_timer_database); uint8_iterator++)
    {
        global_arr_str_timer_database[uint8_iterator].enum_timer_index_in_db                = TIMER_INDEX_INVALID;
        global_arr_str_timer_database[uint8_iterator].enum_timer_mode_in_db                 = TIMER_MODE_INVALID;
        global_arr_str_timer_database[uint8_iterator].enum_timer_prescalar_value_in_db      = TIMER_INVALID_PRESCALAR;
        global_arr_str_timer_database[uint8_iterator].pointer_func_timer_callback_in_db     = NULL_PTR;
        global_arr_str_timer_database[uint8_iterator].uint8_is_timer_enabled_in_db          = FALSE;

    }
}

static sint32_type delay_timer_0(uint32_type uint32_delay_in_ms)
{
    sint32_type sint32_retval                               = SUCCESS_RETVAL;
    uint8_type  uint8_preload_value                         = 0;
    uint32_type uint32_number_of_interrupts                 = 0;
    uint32_type uint32_time_to_overflow_in_ms               = 0;
    uint32_type uint32_tick_time_in_ns                      = 0;
    fint32_type float_exact_number_of_interrupts            = 0;

    if  (
            ((global_arr_str_timer_database[TIMER_INDEX_0].enum_timer_mode_in_db) == TIMER_MODE_OVF) ||
            ((global_arr_str_timer_database[TIMER_INDEX_0].enum_timer_mode_in_db) == TIMER_MODE_CTC)
        )
    {
        /*Calculate the Tick Time in Nano Seconds. In order to avoid losing fractions from the start of the calculations*/
        uint32_tick_time_in_ns = ((global_arr_str_timer_database[TIMER_INDEX_0].enum_timer_prescalar_value_in_db) * MUL_FACTOR) / (F_CPU / CONVERT_FROM_MILLI_TO_MICRO);

        /*Calculate the time till overflow in Milli seconds*/
        uint32_time_to_overflow_in_ms = ((uint32_tick_time_in_ns * COUNTS_TILL_OVERFLOW_IN_8_BIT_TIMER) / CONVERT_FROM_NANO_TO_MILLI);
        
        /*Calculate the total number of Interrupts Needed.*/
        float_exact_number_of_interrupts = (uint32_delay_in_ms * CONVERT_FROM_MILLI_TO_MICRO) / uint32_time_to_overflow_in_ms;
        
        /*Ceiling the Value of the needed interrupts. 
        As if we needed 3.9 Interrupts. This means that we need 3 Interrupts from 0 to 255 and 1 interrupt with a preload value*/
        uint32_number_of_interrupts = (uint32_type) float_exact_number_of_interrupts + 1;

        /*Getting the fraction in the needed value for interrupts*/
        float_exact_number_of_interrupts = float_exact_number_of_interrupts - uint32_number_of_interrupts;

        /*Storing the needed interrupts count in a global variable that will be checked inside the interrupt.*/
        global_timer_0_needed_interrupts = uint32_number_of_interrupts;

        /*Calculating the needed preload value to store in the Register.*/
        uint8_preload_value = OVERFLOW_VALUE_IN_8_BIT_TIMER - (float_exact_number_of_interrupts * COUNTS_TILL_OVERFLOW_IN_8_BIT_TIMER);

        /*Storing the Preload value in the corresponding register based on timer mode.*/
        if((global_arr_str_timer_database[TIMER_INDEX_0].enum_timer_mode_in_db) == TIMER_MODE_OVF)
        {
            REG_TCNT0           = uint8_preload_value;
        }
        else if((global_arr_str_timer_database[TIMER_INDEX_0].enum_timer_mode_in_db) == TIMER_MODE_CTC)
        {
            REG_OCR0           = uint8_preload_value;
        }
    }
    else
    {
        sint32_retval = ERROR_UNSUPPORTED_FEATURE;
    }
    return sint32_retval;
}

static sint32_type delay_timer_1(uint32_type uint32_delay_in_ms)
{
    sint32_type sint32_retval                               = SUCCESS_RETVAL;
    uint16_type uint16_preload_value                        = 0;
    uint32_type uint32_number_of_interrupts                 = 0;
    uint32_type uint32_time_to_overflow_in_ms               = 0;
    uint32_type uint32_tick_time_in_ns                      = 0;
    fint32_type float_exact_number_of_interrupts            = 0;

    if  (
            ((global_arr_str_timer_database[TIMER_INDEX_1].enum_timer_mode_in_db) == TIMER_MODE_OVF) ||
            ((global_arr_str_timer_database[TIMER_INDEX_1].enum_timer_mode_in_db) == TIMER_MODE_CTC)
        )
    {
        /*Calculate the Tick Time in Nano Seconds. In order to avoid losing fractions from the start of the calculations*/
        uint32_tick_time_in_ns = ((global_arr_str_timer_database[TIMER_INDEX_0].enum_timer_prescalar_value_in_db) * MUL_FACTOR) / (F_CPU / CONVERT_FROM_MILLI_TO_MICRO);

        /*Calculate the time till overflow in Milli seconds*/
        uint32_time_to_overflow_in_ms = ((uint32_tick_time_in_ns * COUNTS_TILL_OVERFLOW_IN_8_BIT_TIMER) / CONVERT_FROM_NANO_TO_MILLI);
        
        /*Calculate the total number of Interrupts Needed.*/
        float_exact_number_of_interrupts = (uint32_delay_in_ms * CONVERT_FROM_MILLI_TO_MICRO) / uint32_time_to_overflow_in_ms;
        
        /*Ceiling the Value of the needed interrupts. 
        As if we needed 3.9 Interrupts. This means that we need 3 Interrupts from 0 to 255 and 1 interrupt with a preload value*/
        uint32_number_of_interrupts = (uint32_type) float_exact_number_of_interrupts + 1;

        /*Getting the fraction in the needed value for interrupts*/
        float_exact_number_of_interrupts = float_exact_number_of_interrupts - uint32_number_of_interrupts;

        /*Storing the needed interrupts count in a global variable that will be checked inside the interrupt.*/
        global_timer_2_needed_interrupts = uint32_number_of_interrupts;

        /*Calculating the needed preload value to store in the Register.*/
        uint16_preload_value = OVERFLOW_VALUE_IN_8_BIT_TIMER - (float_exact_number_of_interrupts * COUNTS_TILL_OVERFLOW_IN_8_BIT_TIMER);

        /*Storing the Preload value in the corresponding register based on timer mode.*/
        if((global_arr_str_timer_database[TIMER_INDEX_0].enum_timer_mode_in_db) == TIMER_MODE_OVF)
        {
            REG_TCNT1L           = uint16_preload_value;
        }
        else if((global_arr_str_timer_database[TIMER_INDEX_0].enum_timer_mode_in_db) == TIMER_MODE_CTC)
        {
            REG_OCR1AL           = uint16_preload_value;
        }
    }
    else
    {
        sint32_retval = ERROR_UNSUPPORTED_FEATURE;
    }
    return sint32_retval;
}

static sint32_type delay_timer_2(uint32_type uint32_delay_in_ms)
{
    sint32_type sint32_retval                               = SUCCESS_RETVAL;
    uint8_type  uint8_preload_value                         = 0;
    uint32_type uint32_number_of_interrupts                 = 0;
    uint32_type uint32_time_to_overflow_in_ms               = 0;
    uint32_type uint32_tick_time_in_ns                      = 0;
    fint32_type float_exact_number_of_interrupts            = 0;

    if  (
            ((global_arr_str_timer_database[TIMER_INDEX_2].enum_timer_mode_in_db) == TIMER_MODE_OVF) ||
            ((global_arr_str_timer_database[TIMER_INDEX_2].enum_timer_mode_in_db) == TIMER_MODE_CTC)
        )
    {
        /*Calculate the Tick Time in Nano Seconds. In order to avoid losing fractions from the start of the calculations*/
        uint32_tick_time_in_ns = ((global_arr_str_timer_database[TIMER_INDEX_0].enum_timer_prescalar_value_in_db) * MUL_FACTOR) / (F_CPU / CONVERT_FROM_MILLI_TO_MICRO);

