MinaRaoufAziz/AVR_ATMEGA32A_SDK/timer.c
        /*Calculate the time till overflow in Milli seconds*/
        uint32_time_to_overflow_in_ms = ((uint32_tick_time_in_ns * COUNTS_TILL_OVERFLOW_IN_8_BIT_TIMER) / CONVERT_FROM_NANO_TO_MILLI);
        
        /*Calculate the total number of Interrupts Needed.*/
        float_exact_number_of_interrupts = (uint32_delay_in_ms * CONVERT_FROM_MILLI_TO_MICRO) / uint32_time_to_overflow_in_ms;
        
        /*Ceiling the Value of the needed interrupts. 
        As if we needed 3.9 Interrupts. This means that we need 3 Interrupts from 0 to 255 and 1 interrupt with a preload value*/
        uint32_number_of_interrupts = (uint32_type) float_exact_number_of_interrupts + 1;

        /*Getting the fraction in the needed value for interrupts*/
        float_exact_number_of_interrupts = float_exact_number_of_interrupts - uint32_number_of_interrupts;

        /*Storing the needed interrupts count in a global variable that will be checked inside the interrupt.*/
        global_timer_2_needed_interrupts = uint32_number_of_interrupts;

        /*Calculating the needed preload value to store in the Register.*/
        uint8_preload_value = OVERFLOW_VALUE_IN_8_BIT_TIMER - (float_exact_number_of_interrupts * COUNTS_TILL_OVERFLOW_IN_8_BIT_TIMER);

        /*Storing the Preload value in the corresponding register based on timer mode.*/
        if((global_arr_str_timer_database[TIMER_INDEX_0].enum_timer_mode_in_db) == TIMER_MODE_OVF)
        {
            REG_TCNT2           = uint8_preload_value;
        }
        else if((global_arr_str_timer_database[TIMER_INDEX_0].enum_timer_mode_in_db) == TIMER_MODE_CTC)
        {
            REG_OCR2           = uint8_preload_value;
        }
    }
    else
    {
        sint32_retval = ERROR_UNSUPPORTED_FEATURE;
    }
    return sint32_retval;
}

static sint32_type generate_pwm_timer_0(uint8_type uint8_duty_cycle)
{
    sint32_type sint32_retval = SUCCESS_RETVAL;
    if  (
            ((global_arr_str_timer_database[TIMER_INDEX_2].enum_timer_mode_in_db) == TIMER_MODE_PWM) ||
            ((global_arr_str_timer_database[TIMER_INDEX_2].enum_timer_mode_in_db) == TIMER_MODE_PHASE_PWM)
        )
    {
        /*Put Timer 0 PWM Generation Logic Here*/
    }
    else
    {
        sint32_retval = ERROR_UNSUPPORTED_FEATURE;
    }
    return sint32_retval;
}

static sint32_type generate_pwm_timer_1(uint8_type uint8_duty_cycle)
{
    sint32_type sint32_retval = SUCCESS_RETVAL;
    if  (
            ((global_arr_str_timer_database[TIMER_INDEX_2].enum_timer_mode_in_db) == TIMER_MODE_PWM) ||
            ((global_arr_str_timer_database[TIMER_INDEX_2].enum_timer_mode_in_db) == TIMER_MODE_PHASE_PWM)
        )
    {
        /*Put Timer 1 PWM Generation Logic Here*/
    }
    else
    {
        sint32_retval = ERROR_UNSUPPORTED_FEATURE;
    }
    return sint32_retval;
}

static sint32_type generate_pwm_timer_2(uint8_type uint8_duty_cycle)
{
    sint32_type sint32_retval = SUCCESS_RETVAL;
    if  (
            ((global_arr_str_timer_database[TIMER_INDEX_2].enum_timer_mode_in_db) == TIMER_MODE_PWM) ||
            ((global_arr_str_timer_database[TIMER_INDEX_2].enum_timer_mode_in_db) == TIMER_MODE_PHASE_PWM)
        )
    {
        /*Put Timer 2 PWM Generation Logic Here*/
    }
    else
    {
        sint32_retval = ERROR_UNSUPPORTED_FEATURE;
    }
    return sint32_retval;
}

static void wait_for_timer_interrupt_flag(enum_timer_index_type enum_timer_index_with_polling)
{
    static uint32_type uint32_local_interrupt_counter = 0;
    uint8_type uint8_is_valid_timer_index = TRUE;
    switch(enum_timer_index_with_polling)
    {
        case TIMER_INDEX_0:
        case TIMER_INDEX_1:
        case TIMER_INDEX_2:
        {
            break;
        }
        default:
        {
            uint8_is_valid_timer_index = FALSE;
            break;
        }
    }
    
    if(uint8_is_valid_timer_index == TRUE)
    {
        if(global_arr_str_timer_database[enum_timer_index_with_polling].enum_timer_mode_in_db == TIMER_MODE_OVF)
        {
            if(enum_timer_index_with_polling == TIMER_INDEX_0)
            {
                while(GET_BIT(REG_TIFR, TOV0_BIT) == 1);
                uint32_local_interrupt_counter++;
                if(uint32_local_interrupt_counter == global_timer_0_needed_interrupts)
                {
                    global_arr_str_timer_database[TIMER_INDEX_0].pointer_func_timer_callback_in_db(TIMER_INDEX_0);
                }
            }
            else if(enum_timer_index_with_polling == TIMER_INDEX_1)
            {

            }
            else if(enum_timer_index_with_polling == TIMER_INDEX_2)
            {
                while(GET_BIT(REG_TIFR, TOV2_BIT) == 0);
                uint32_local_interrupt_counter++;
                if(uint32_local_interrupt_counter == global_timer_2_needed_interrupts)
                {
                    global_arr_str_timer_database[TIMER_INDEX_2].pointer_func_timer_callback_in_db(TIMER_INDEX_2);
                }
            }
            else
            {

            }
        }
        else if(global_arr_str_timer_database[enum_timer_index_with_polling].enum_timer_mode_in_db == TIMER_MODE_CTC)
        {
            if(enum_timer_index_with_polling == TIMER_INDEX_0)
            {
                while(GET_BIT(REG_TIFR, OCF0_BIT) == 0);
                uint32_local_interrupt_counter++;
                if(uint32_local_interrupt_counter == global_timer_2_needed_interrupts)
                {
                    global_arr_str_timer_database[TIMER_INDEX_2].pointer_func_timer_callback_in_db(TIMER_INDEX_2);
                }
            }
            else if(enum_timer_index_with_polling == TIMER_INDEX_1)
            {

            }
            else if(enum_timer_index_with_polling == TIMER_INDEX_2)
            {
                while(GET_BIT(REG_TIFR, OCF2_BIT) == 0);
                uint32_local_interrupt_counter++;
                if(uint32_local_interrupt_counter == global_timer_2_needed_interrupts)
                {
                    global_arr_str_timer_database[TIMER_INDEX_2].pointer_func_timer_callback_in_db(TIMER_INDEX_2);
                }
            }
            else
            {

