MinaRaoufAziz/AVR_ATMEGA32A_SDK/timer.c
            }
        }
    }
}

/**
 * @brief: 		Function that is used to initialize each timer.
 * 
 * @param[in] 	pstr_timer_config: 	Constant Pointer to Constant Structure that contains the Required Timer Configuration
 * @return:		SUCCESS_RETVAL:	in case of success.
 * 				ERROR_INVALID_ARGUMENTS: In case of Invalid Arguments Passed to the function.
 * 				ERROR_MODULE_ALREADY_INITAILIZED: In case that this timer is already initialized previously. 
 */
sint32_type timer_init(const tstr_timer_config* const pstr_timer_config)
{
    sint32_type sint32_retval                           = SUCCESS_RETVAL;
    uint8_type  uint8_need_to_save_in_timer_database    = TRUE;
    if(pstr_timer_config != NULL_PTR)
    {
        /*  This is done to assure that the timer driver local database is initialized one time only. 
            To avoid corrupting the previous intialized data upon multiple calling to the timer_init function with different configurations.
        */
        if(global_bool_need_to_init_database == TRUE)
        {
            init_timers_database();
            global_bool_need_to_init_database = FALSE;
        }

        /*Input Parameters check. This to assure that all the parameters passed are right parameters to operate on.*/
        if  (
                ((pstr_timer_config->enum_timer_index) < TIMER_INDEX_INVALID) &&
                ((pstr_timer_config->enum_timer_interrupt_usage) < TIMER_USAGE_INVALID) &&
                ((pstr_timer_config->enum_timer_mode) < TIMER_MODE_INVALID) &&
                ((pstr_timer_config->pointer_func_timer_callback) != NULL_PTR)
            )
        {
            if  (
                    ((global_arr_str_timer_database[pstr_timer_config->enum_timer_index].uint8_is_timer_enabled_in_db) == FALSE)                        && 
                    ((global_arr_str_timer_database[pstr_timer_config->enum_timer_index].enum_timer_index_in_db) == TIMER_INDEX_INVALID)                && 
                    ((global_arr_str_timer_database[pstr_timer_config->enum_timer_index].enum_timer_mode_in_db) == TIMER_MODE_INVALID)                  && 
                    ((global_arr_str_timer_database[pstr_timer_config->enum_timer_index].enum_timer_prescalar_value_in_db) == TIMER_INVALID_PRESCALAR)  && 
                    ((global_arr_str_timer_database[pstr_timer_config->enum_timer_index].pointer_func_timer_callback_in_db) == NULL_PTR)
                )
            {
                /*This means that this timer has no saved data in the database. So it's not initialized previously.*/
                switch(pstr_timer_config->enum_timer_index)
                {
                    case TIMER_INDEX_0:
                    {
                        if((pstr_timer_config->enum_timer_interrupt_usage) == TIMER_USAGE_INTERRUPT)
                        {
                            if((pstr_timer_config->enum_timer_mode) == TIMER_MODE_OVF)
                            {
                                /*Enable Global Interrupt*/
                                SET_BIT(REG_SREG, I_BIT);   
                                /*Enable Peripheral Interrupt*/
                                SET_BIT(REG_TIMSK, TOIE0_BIT);
                            }
                            else if((pstr_timer_config->enum_timer_mode) == TIMER_MODE_CTC)
                            {
                                /*Enable Global Interrupt*/
                                SET_BIT(REG_SREG, I_BIT);   
                                /*Enable Peripheral Interrupt*/
                                SET_BIT(REG_TIMSK, OCIE0_BIT);   
                            }
                        }
                        else if((pstr_timer_config->enum_timer_interrupt_usage) == TIMER_USAGE_POLLING)
                        {
                            /*Do Nothing. Just save the timer index in the global to handle it in the timer dispatcher*/
                            global_timer_index_with_polling = TIMER_INDEX_0;
                        }

                        if((pstr_timer_config->enum_timer_mode) == TIMER_MODE_OVF)
                        {
                            CLEAR_BIT(REG_TCCR0, WGM00_BIT);
                            CLEAR_BIT(REG_TCCR0, WGM01_BIT);
                        }
                        else if((pstr_timer_config->enum_timer_mode) == TIMER_MODE_CTC)
                        {
                            CLEAR_BIT(REG_TCCR0, WGM00_BIT);
                            SET_BIT(REG_TCCR0, WGM01_BIT);
                        }
                        else if((pstr_timer_config->enum_timer_mode) == TIMER_MODE_PWM)
                        {
                            SET_BIT(REG_TCCR0, WGM00_BIT);
                            SET_BIT(REG_TCCR0, WGM01_BIT);
                        }
                        else if((pstr_timer_config->enum_timer_mode) == TIMER_MODE_PHASE_PWM)
                        {
                            SET_BIT(REG_TCCR0, WGM00_BIT);
                            CLEAR_BIT(REG_TCCR0, WGM01_BIT);
                        }

                        break;
                    }

                    case TIMER_INDEX_1:
                    {
                        if((pstr_timer_config->enum_timer_interrupt_usage) == TIMER_USAGE_INTERRUPT)
                        {
                            /*Put Timer 1 Interrupt Configurations here.*/
                        }
                        else if((pstr_timer_config->enum_timer_interrupt_usage) == TIMER_USAGE_POLLING)
                        {
                            /*Do Nothing.*/
                        }

                        if((pstr_timer_config->enum_timer_mode) == TIMER_MODE_OVF)
                        {
                            /*Put Timer 1 Overflow configurations here.*/
                        }
                        else if((pstr_timer_config->enum_timer_mode) == TIMER_MODE_CTC)
                        {
                            /*Put Timer 1 Clear Timer on Compare Match configurations here.*/
                        }
                        else if((pstr_timer_config->enum_timer_mode) == TIMER_MODE_PWM)
                        {
                            /*Put Timer 1 Pulse Width Modulation configurations here.*/
                        }
                        else if((pstr_timer_config->enum_timer_mode) == TIMER_MODE_PHASE_PWM)
                        {
                            /*Put Timer 1 Fast Pulse Width Modulation configurations here.*/
                        }
                        break;
                    }

                    case TIMER_INDEX_2:
                    {
                        if((pstr_timer_config->enum_timer_interrupt_usage) == TIMER_USAGE_INTERRUPT)
                        {
                            if((pstr_timer_config->enum_timer_mode) == TIMER_MODE_OVF)
                            {
                                /*Enable Global Interrupt*/
                                SET_BIT(REG_SREG, I_BIT);   
                                /*Enable Peripheral Interrupt*/
                                SET_BIT(REG_TIMSK, TOIE2_BIT);
                            }
                            else if((pstr_timer_config->enum_timer_mode) == TIMER_MODE_CTC)
                            {
                                /*Enable Global Interrupt*/
                                SET_BIT(REG_SREG, I_BIT);   
                                /*Enable Peripheral Interrupt*/
                                SET_BIT(REG_TIMSK, OCIE2_BIT);   
                            }
                        }
                        else if((pstr_timer_config->enum_timer_interrupt_usage) == TIMER_USAGE_POLLING)
                        {
                            /*Do Nothing. Just save the timer index in the global to handle it in the timer dispatcher*/
                            global_timer_index_with_polling = TIMER_INDEX_2;
                        }

