MinaRaoufAziz/AVR_ATMEGA32A_SDK/timer.c
                        if((pstr_timer_config->enum_timer_mode) == TIMER_MODE_OVF)
                        {
                            CLEAR_BIT(REG_TCCR2, WGM20_BIT);
                            CLEAR_BIT(REG_TCCR2, WGM21_BIT);
                        }
                        else if((pstr_timer_config->enum_timer_mode) == TIMER_MODE_CTC)
                        {
                            CLEAR_BIT(REG_TCCR2, WGM20_BIT);
                            SET_BIT(REG_TCCR2, WGM21_BIT);
                        }
                        else if((pstr_timer_config->enum_timer_mode) == TIMER_MODE_PWM)
                        {
                            SET_BIT(REG_TCCR2, WGM20_BIT);
                            SET_BIT(REG_TCCR2, WGM21_BIT);
                        }
                        else if((pstr_timer_config->enum_timer_mode) == TIMER_MODE_PHASE_PWM)
                        {
                            SET_BIT(REG_TCCR2, WGM20_BIT);
                            CLEAR_BIT(REG_TCCR2, WGM21_BIT);
                        }
                        break;
                    }

                    default:
                    {
                        /*Unsupported Timer Index. We shall not save this parameters in the database.*/
                        uint8_need_to_save_in_timer_database = FALSE;
                        break;
                    }
                }

                if(uint8_need_to_save_in_timer_database == TRUE)
                {
                    /*Save the Passed Configurations in the Local Timer Database*/
                    global_arr_str_timer_database[pstr_timer_config->enum_timer_index].enum_timer_index_in_db               = pstr_timer_config->enum_timer_index;
                    global_arr_str_timer_database[pstr_timer_config->enum_timer_index].enum_timer_mode_in_db                = pstr_timer_config->enum_timer_mode;
                    global_arr_str_timer_database[pstr_timer_config->enum_timer_index].enum_timer_prescalar_value_in_db     = pstr_timer_config->enum_timer_prescalar_value;
                    global_arr_str_timer_database[pstr_timer_config->enum_timer_index].pointer_func_timer_callback_in_db    = pstr_timer_config->pointer_func_timer_callback;
                }
            }
            else
            {
                /*This means that this timer has a saved configuration parameters in the database. So it's initialized previously.*/
                sint32_retval = ERROR_MODULE_ALREADY_INITAILIZED;
            }
        }
        /*This shall be set to ERROR_INVALID_ARGUMENTS. But it's assigned to ERROR_UNSUPPORTED_FEATURE to differentiate the errors returned from this function.*/
        else
        {
            sint32_retval = ERROR_UNSUPPORTED_FEATURE;
        }
    }
    else
    {
        sint32_retval = ERROR_INVALID_ARGUMENTS;
    }
    return sint32_retval;
}

/**
 * @brief:		Function that is used to deinitialize a specific timer. 
 * 				This shall be used to re-initialize the timer with a new configurations by calling @fn: timer_init and pass the new configurations.
 * 				Or to erase the configurations of a specific timer and disable it.
 * 
 * @param[in] 	enum_timer_index: The timer index the user wants to uninitialize 
 * @return 		SUCCESS_RETVAL:	in case of success. 
 *				ERROR_INVALID_ARGUMENTS: In case of Invalid Arguments Passed to the function.
 * 				ERROR_MODULE_NOT_INITAILIZED: in case that this timer was not initialized previously.
 */
sint32_type timer_deinit(enum_timer_index_type enum_timer_index)
{
    sint32_type sint32_retval = SUCCESS_RETVAL;
    if(enum_timer_index < TIMER_INDEX_INVALID)
    {
        if  (                    
                ((global_arr_str_timer_database[enum_timer_index].enum_timer_index_in_db) == TIMER_INDEX_INVALID)   && 
                ((global_arr_str_timer_database[enum_timer_index].enum_timer_mode_in_db) == TIMER_MODE_INVALID)     && 
                ((global_arr_str_timer_database[enum_timer_index].enum_timer_prescalar_value_in_db) == TIMER_INVALID_PRESCALAR)     && 
                ((global_arr_str_timer_database[enum_timer_index].pointer_func_timer_callback_in_db) == NULL_PTR)
            )
        {
            /*This means that this timer doesn't have a saved configuration parameters in the database. So it's not initialized previously.*/
            sint32_retval = ERROR_MODULE_NOT_INITAILIZED;
        }
        else
        {
            global_arr_str_timer_database[enum_timer_index].uint8_is_timer_enabled_in_db        = FALSE;
            global_arr_str_timer_database[enum_timer_index].enum_timer_index_in_db              = TIMER_INDEX_INVALID;
            global_arr_str_timer_database[enum_timer_index].enum_timer_mode_in_db               = TIMER_MODE_INVALID;
            global_arr_str_timer_database[enum_timer_index].enum_timer_prescalar_value_in_db    = TIMER_INVALID_PRESCALAR;
            global_arr_str_timer_database[enum_timer_index].pointer_func_timer_callback_in_db   = NULL_PTR;
        }
    }
    else
    {
        sint32_retval = ERROR_INVALID_ARGUMENTS;
    }
    return sint32_retval;
}

/**
 * @brief: 		Function that is used to start the timer by enabling the clock signal to it.
 * 
 * @param[in] 	enum_timer_index: 	Index of the Enumeration that indicates which timer to enable.
 * @return:		SUCCESS_RETVAL:	in case of success, or in case that the timer is already enabled. Ie, this API was called previously for this specific timer index.
 * 				ERROR_INVALID_ARGUMENTS: In case of Invalid Arguments Passed to the function.
 * 				ERROR_MODULE_NOT_INITAILIZED: In case that this timer is not configured yet. Ie, the initialization is not done yet for this specific index. 
 */
sint32_type timer_enable(enum_timer_index_type enum_timer_index)
{
    sint32_type sint32_retval                           = SUCCESS_RETVAL;
    uint8_type  uint8_need_to_save_in_timer_database    = TRUE;
    if(enum_timer_index < TIMER_INDEX_INVALID)
    {
        if  (                    
                ((global_arr_str_timer_database[enum_timer_index].uint8_is_timer_enabled_in_db) == FALSE)                       && 
                ((global_arr_str_timer_database[enum_timer_index].enum_timer_index_in_db) == TIMER_INDEX_INVALID)               && 
                ((global_arr_str_timer_database[enum_timer_index].enum_timer_prescalar_value_in_db) == TIMER_INVALID_PRESCALAR) && 
                ((global_arr_str_timer_database[enum_timer_index].enum_timer_mode_in_db) == TIMER_MODE_INVALID)                 && 
                ((global_arr_str_timer_database[enum_timer_index].pointer_func_timer_callback_in_db) == NULL_PTR)
            )
        {
            /*This means that this timer doesn't have a saved configuration parameters in the database. So it's not initialized previously.*/
            sint32_retval = ERROR_MODULE_NOT_INITAILIZED;
        }
        else
        {
            if((global_arr_str_timer_database[enum_timer_index].uint8_is_timer_enabled_in_db) == FALSE)
            {
                switch(enum_timer_index)
                {
                    case TIMER_INDEX_0:
                    {
                        /*Put the Sequence of Enabling Timer 0 Here*/
                        switch(global_arr_str_timer_database[enum_timer_index].enum_timer_prescalar_value_in_db)
                        {
                            case TIMER_NO_PRESCALAR:
                            {
                                REG_TCCR0 = REG_TCCR0 | 0x01;
                                break;
                            }
                            case TIMER_8_PRESCALAR:
                            {
                                REG_TCCR0 = REG_TCCR0 | 0x02;
                                break;
                            }
                            case TIMER_64_PRESCALAR:
                            {
                                REG_TCCR0 = REG_TCCR0 | 0x03;
                                break;
                            }
                            case TIMER_256_PRESCALAR:
                            {
                                REG_TCCR0 = REG_TCCR0 | 0x04;
                                break;
                            }
                            case TIMER_1024_PRESCALAR:
                            {
                                REG_TCCR0 = REG_TCCR0 | 0x05;
                                break;
                            }
                            default:
                            {
                                break;
                            }
                        }
                        
                        break;
                    }
                    case TIMER_INDEX_1:
                    {
                        /*Put the Sequence of Enabling Timer 1 Here*/
                        break;
                    }
                    case TIMER_INDEX_2:
                    {
                        /*Put the Sequence of Enabling Timer 2 Here*/
                        switch(global_arr_str_timer_database[enum_timer_index].enum_timer_prescalar_value_in_db)
                        {
                            case TIMER_NO_PRESCALAR:
                            {
                                REG_TCCR2 = REG_TCCR2 | 0x01;
                                break;
                            }
                            case TIMER_8_PRESCALAR:
                            {
                                REG_TCCR2 = REG_TCCR2 | 0x02;
                                break;
                            }
                            case TIMER_64_PRESCALAR:
                            {
                                REG_TCCR2 = REG_TCCR2 | 0x03;
                                break;
                            }
                            case TIMER_256_PRESCALAR:
                            {
                                REG_TCCR2 = REG_TCCR2 | 0x04;
                                break;
                            }
                            case TIMER_1024_PRESCALAR:
                            {
                                REG_TCCR2 = REG_TCCR2 | 0x05;
                                break;
                            }
                            default:
                            {
                                break;
                            }
                        }
                        break;
                    }
                    default:
                    {
                        uint8_need_to_save_in_timer_database = FALSE;
                        /*This shall be set to ERROR_INVALID_ARGUMENTS. But it's assigned to ERROR_UNSUPPORTED_FEATURE to differentiate the errors returned from this function.*/
                        sint32_retval = ERROR_UNSUPPORTED_FEATURE;
                        break;
                    }
                }
                if(uint8_need_to_save_in_timer_database == TRUE)
                {
                    global_arr_str_timer_database[enum_timer_index].uint8_is_timer_enabled_in_db = TRUE;
                }
            }
            else
            {
                /*Entering Here means that the database info is not saved right.*/
                sint32_retval = ERROR_INVALD_LENGTH;
            }
        }
    }
    else
    {
        sint32_retval = ERROR_INVALID_ARGUMENTS;
    }
    return sint32_retval;
}

/**
 * @brief: 		Function that is used to stop the timer by disabling the clock signal to it.
 * 
 * @param[in]	enum_timer_index: 	Index of the Enumeration that indicates which timer to disable. 
 * @return 		SUCCESS_RETVAL: In case of success, or the timer is already disabled (This API was called previously for this specific timer index), or that the @fn: timer_enable was not called previously for this specific timer. 
 *  			ERROR_INVALID_ARGUMENTS: In case of Invalid Arguments Passed to the function.
 * 				ERROR_MODULE_NOT_INITAILIZED: In case that this timer is not configured yet. Ie, the initialization is not done yet for this specific index. 
 */
sint32_type timer_disable(enum_timer_index_type enum_timer_index)
{
    sint32_type sint32_retval                           = SUCCESS_RETVAL;
    uint8_type  uint8_need_to_save_in_timer_database    = TRUE;
    if(enum_timer_index < TIMER_INDEX_INVALID)
    {
        if  (
                ((global_arr_str_timer_database[enum_timer_index].uint8_is_timer_enabled_in_db) == FALSE)           && 
                ((global_arr_str_timer_database[enum_timer_index].enum_timer_index_in_db) == TIMER_INDEX_INVALID)   && 
                ((global_arr_str_timer_database[enum_timer_index].enum_timer_mode_in_db) == TIMER_MODE_INVALID)     && 
                ((global_arr_str_timer_database[enum_timer_index].pointer_func_timer_callback_in_db) == NULL_PTR) 
            )
        {
            /*This means that this timer doesn't have a saved configuration parameters in the database. So it's not initialized previously.*/
            sint32_retval = ERROR_MODULE_NOT_INITAILIZED;
        }
        else
        {
            if((global_arr_str_timer_database[enum_timer_index].uint8_is_timer_enabled_in_db) == TRUE)
            {
                switch(enum_timer_index)
                {
                    case TIMER_INDEX_0:
                    {
                        /*Put the Sequence of Disabling Timer 0 Here*/
                        REG_TCCR0 = REG_TCCR0 & DISABLE_TIMER_MASK;
                        break;
                    }
                    case TIMER_INDEX_1:
                    {
                        /*Put the Sequence of Disabling Timer 1 Here*/
                        break;
                    }
                    case TIMER_INDEX_2:
                    {
                        /*Put the Sequence of Disabling Timer 2 Here*/
                        REG_TCCR2 = REG_TCCR2 & DISABLE_TIMER_MASK;
                        break;
                    }
                    default:
                    {
                        uint8_need_to_save_in_timer_database = FALSE;
                        /*This shall be set to ERROR_INVALID_ARGUMENTS. But it's assigned to ERROR_UNSUPPORTED_FEATURE to differentiate the errors returned from this function.*/
                        sint32_retval = ERROR_UNSUPPORTED_FEATURE;
                        break;
                    }
                }
                if(uint8_need_to_save_in_timer_database == TRUE)
                {
                    global_arr_str_timer_database[enum_timer_index].uint8_is_timer_enabled_in_db = FALSE;
                }
            }
            else
            {
                /*Entering Here means that the database info is not saved right.*/
                sint32_retval = ERROR_INVALD_LENGTH;
            }
        }
    }
    else
    {
        sint32_retval = ERROR_INVALID_ARGUMENTS;
    }
    return sint32_retval;
}

/**
 * @brief:		Function that is used to set a specific delay value for a specific timer index.
 * @note:		The Delay will be done here is a single shot. 
 * 				This means that this delay will be done for one time only. After the timer finishes the delay value, it will execute the timer callback.
 * 
 * @param[in] 	enum_timer_index: 	Enumeration for the specific timer index the user wants to delay.
 * @param[in] 	uint32_delay_in_ms: The specific delay value in Milli Seconds.
 * @return 		SUCCESS_RETVAL: In case of success. 
 *  			ERROR_INVALID_ARGUMENTS: In case of Invalid Arguments Passed to the function.
 * 				ERROR_MODULE_NOT_INITAILIZED: In case that this timer is not configured yet. Ie, the initialization is not done yet for this specific index. 
 */
sint32_type timer_delay(enum_timer_index_type enum_timer_index, uint32_type uint32_delay_in_ms)
{
    sint32_type sint32_retval = SUCCESS_RETVAL;
    if((enum_timer_index < TIMER_INDEX_INVALID) && (uint32_delay_in_ms > MIN_DELAY_VALUE))
    {
        if  (                    
                ((global_arr_str_timer_database[enum_timer_index].uint8_is_timer_enabled_in_db) == FALSE)           && 
                ((global_arr_str_timer_database[enum_timer_index].enum_timer_index_in_db) == TIMER_INDEX_INVALID)   && 
                ((global_arr_str_timer_database[enum_timer_index].enum_timer_mode_in_db) == TIMER_MODE_INVALID)     && 
                ((global_arr_str_timer_database[enum_timer_index].pointer_func_timer_callback_in_db) == NULL_PTR)
            )
        {
            /*This means that this timer doesn't have a saved configuration parameters in the database. So it's not initialized previously.*/
            sint32_retval = ERROR_MODULE_NOT_INITAILIZED;
        }
        else
        {
            if((global_arr_str_timer_database[enum_timer_index].uint8_is_timer_enabled_in_db) == FALSE)
            {
                switch(enum_timer_index)
                {
                    case TIMER_INDEX_0:
                    {
                        timer_enable(TIMER_INDEX_0);
                        sint32_retval = delay_timer_0(uint32_delay_in_ms);
                        break;
                    }
                    case TIMER_INDEX_1:
                    {
						timer_enable(TIMER_INDEX_1);
                        sint32_retval = delay_timer_1(uint32_delay_in_ms);
                        break;
                    }
                    case TIMER_INDEX_2:
                    {
                        timer_enable(TIMER_INDEX_2);
                        sint32_retval = delay_timer_2(uint32_delay_in_ms);
                        break;
                    }
                    default:
                    {
                        sint32_retval = ERROR_OUT_OF_BOUNDARY;
                        break;
                    }
                }
            }
            else
            {
                sint32_retval = ERROR_UNSUPPORTED_FEATURE;
            }
        }
    }
    else
    {
        sint32_retval = ERROR_INVALID_ARGUMENTS;       
    }
    return sint32_retval;
}

/**
 * @brief:		Function that is used to generate a PWM (Pulse Width Modulation) for the timer
 * 
 * @param[in] 	enum_timer_index: 	Enumeration for the specific timer index the user wants to generate a PWM on it. 
 * @param[in] 	uint8_duty_cycle:	Timer Duty Cycle the user wants to generate on the timer. 
 * @return 		SUCCESS_RETVAL: In case of success. 
 *  			ERROR_MODULE_NOT_INITAILIZED: In case that this timer is not configured yet. Ie, the initialization is not done yet for this specific index. 
 * 				ERROR_UNSUPPORTED_FEATURE: In case that this timer was not configured in the @fn: timer_init in the @member: enum_timer_mode in the @struct: tstr_timer_config was not equal to TIMER_MODE_PWM | TIMER_MODE_PHASE_PWM
 */
sint32_type	timer_generate_pwm(enum_timer_index_type enum_timer_index, uint8_type uint8_duty_cycle)
{
    sint32_type sint32_retval = SUCCESS_RETVAL;
    if((enum_timer_index < TIMER_INDEX_INVALID) && (uint8_duty_cycle > MIN_DUTY_CYCLE_VALUE) && (uint8_duty_cycle < MAX_DUTY_CYCLE_VALUE))
    {
        if  (                    
                ((global_arr_str_timer_database[enum_timer_index].uint8_is_timer_enabled_in_db) == FALSE)           && 
                ((global_arr_str_timer_database[enum_timer_index].enum_timer_index_in_db) == TIMER_INDEX_INVALID)   && 
                ((global_arr_str_timer_database[enum_timer_index].enum_timer_mode_in_db) == TIMER_MODE_INVALID)     && 
                ((global_arr_str_timer_database[enum_timer_index].pointer_func_timer_callback_in_db) == NULL_PTR)
            )
        {
            /*This means that this timer doesn't have a saved configuration parameters in the database. So it's not initialized previously.*/
            sint32_retval = ERROR_MODULE_NOT_INITAILIZED;
        }
        else
        {
            if((global_arr_str_timer_database[enum_timer_index].uint8_is_timer_enabled_in_db) == TRUE)
            {
                switch(enum_timer_index)
                {
                    case TIMER_INDEX_0:
                    {
                        sint32_retval = generate_pwm_timer_0(uint8_duty_cycle);
                        break;
                    }
                    case TIMER_INDEX_1:
                    {
                        sint32_retval = generate_pwm_timer_1(uint8_duty_cycle);
                        break;
                    }
                    case TIMER_INDEX_2:
                    {
                        sint32_retval = generate_pwm_timer_2(uint8_duty_cycle);
                        break;
                    }
                    default:
                    {
                        sint32_retval = ERROR_OUT_OF_BOUNDARY;
                        break;
                    }
                }
            }
            else
            {
                sint32_retval = ERROR_UNSUPPORTED_FEATURE;
            }
        }
    }
    else
    {
        sint32_retval = ERROR_INVALID_ARGUMENTS;
    }
    return sint32_retval;
}

void timer_dispatcher(void)
{
    wait_for_timer_interrupt_flag(global_timer_index_with_polling);
}
